"""Вывести все квадраты чисел от 1 до 10"""
for number in range(1, 11):
    print(f'{number} ^ 2 = {number ** 2}')

# переписать это с помощью while
